<template>
  <el-row :gutter="24">
    <el-col :span="6" v-for="(item, i) in ents.slice(0, 8)" :key="i">
      <CompanyCard :item="item" />
    </el-col>
  </el-row>
</template>

<script>
import CompanyCard from "@/components/search/CompanyCard.vue";
// import axios from 'axios';

export default {
  components: {
    CompanyCard,
  },
  data() {
    // 기업 회원 조회
    // axios.get('https://52.79.162.52:8443/ent')
    // .then((res)=>)
    // .catch()

    return {
      ents: [
        {
          ent_ind: 0,
          ent_name: "삼성전자",
          ent_info:
            "대한민국에 본사를 두고 전자제품을 제조하는 대한민국 최대의 다국적 기업. 창사 이래로 세계 시장에서 한국 기업으로서는 매우 큰 성공을 이루어냈으며, 현재 가장 인지도가 높은 대표적인 한국 기업으로 자리매김하였다.",
          ent_ceo: "이재용",
          ent_img: "../assets/삼성전자.jpg",
          follow: true,
        },
        {
          ent_id: 1,
          ent_name: "삼성SDS",
          ent_info:
            "삼성(三星) 계열 전산업체로, 삼성의 IT서비스와 물류 사업을 담당하고 있다. 뒷글자만 다른 삼성SDI와 혼동하기 쉽다. 매출이나 이익면에서 국내 IT서비스/시스템 통합 업종에서 단연 최고라 할 수 있다.",
          ent_ceo: "황성우",
          ent_img: "../assets/삼성전자.jpg",
          follow: false,
        },
        {
          ent_id: 2,
          ent_name: "삼성물산주식회사",
          ent_info:
            "삼성그룹(三星) 계열 종합물류/무역/레저/건설 회사이자 삼성의 모태가 되는 회사. 그렇지만, 이런 경제적 위상보다는 삼성그룹의 실질 지주회사라는 정치적 위상이 더 크다. 삼성생명 주식 19.47%, 삼성전자 주식 5.01%[3], 삼성바이오로직스 주식 43.44%를 소유했기 때문. 오너 일가가 직접 보유한 삼성전자 지분과 삼성물산, 삼성생명이 보유한 삼성전자 지분을 모두 합하면 19.31%에 달하고, 기타 계열사들과 재단 지분까지 합하면 21%에 가깝다.",
          ent_ceo: "고정석 외 2인",
          ent_img: "../assets/삼성전자.jpg",
          follow: false,
        },
        {
          ent_ind: 0,
          ent_name: "삼성전자",
          ent_info:
            "대한민국에 본사를 두고 전자제품을 제조하는 대한민국 최대의 다국적 기업. 창사 이래로 세계 시장에서 한국 기업으로서는 매우 큰 성공을 이루어냈으며, 현재 가장 인지도가 높은 대표적인 한국 기업으로 자리매김하였다.",
          ent_ceo: "이재용",
          ent_img: "../assets/삼성전자.jpg",
          follow: true,
        },
        {
          ent_id: 1,
          ent_name: "삼성SDS",
          ent_info:
            "삼성(三星) 계열 전산업체로, 삼성의 IT서비스와 물류 사업을 담당하고 있다. 뒷글자만 다른 삼성SDI와 혼동하기 쉽다. 매출이나 이익면에서 국내 IT서비스/시스템 통합 업종에서 단연 최고라 할 수 있다.",
          ent_ceo: "황성우",
          ent_img: "../assets/삼성전자.jpg",
          follow: false,
        },
        {
          ent_id: 2,
          ent_name: "삼성물산주식회사",
          ent_info:
            "삼성그룹(三星) 계열 종합물류/무역/레저/건설 회사이자 삼성의 모태가 되는 회사. 그렇지만, 이런 경제적 위상보다는 삼성그룹의 실질 지주회사라는 정치적 위상이 더 크다. 삼성생명 주식 19.47%, 삼성전자 주식 5.01%[3], 삼성바이오로직스 주식 43.44%를 소유했기 때문. 오너 일가가 직접 보유한 삼성전자 지분과 삼성물산, 삼성생명이 보유한 삼성전자 지분을 모두 합하면 19.31%에 달하고, 기타 계열사들과 재단 지분까지 합하면 21%에 가깝다.",
          ent_ceo: "고정석 외 2인",
          ent_img: "../assets/삼성전자.jpg",
          follow: false,
        },
        {
          ent_ind: 0,
          ent_name: "삼성전자",
          ent_info:
            "대한민국에 본사를 두고 전자제품을 제조하는 대한민국 최대의 다국적 기업. 창사 이래로 세계 시장에서 한국 기업으로서는 매우 큰 성공을 이루어냈으며, 현재 가장 인지도가 높은 대표적인 한국 기업으로 자리매김하였다.",
          ent_ceo: "이재용",
          ent_img: "../assets/삼성전자.jpg",
          follow: true,
        },
        {
          ent_id: 1,
          ent_name: "삼성SDS",
          ent_info:
            "삼성(三星) 계열 전산업체로, 삼성의 IT서비스와 물류 사업을 담당하고 있다. 뒷글자만 다른 삼성SDI와 혼동하기 쉽다. 매출이나 이익면에서 국내 IT서비스/시스템 통합 업종에서 단연 최고라 할 수 있다.",
          ent_ceo: "황성우",
          ent_img: "../assets/삼성전자.jpg",
          follow: false,
        },
        {
          ent_id: 2,
          ent_name: "삼성물산주식회사",
          ent_info:
            "삼성그룹(三星) 계열 종합물류/무역/레저/건설 회사이자 삼성의 모태가 되는 회사. 그렇지만, 이런 경제적 위상보다는 삼성그룹의 실질 지주회사라는 정치적 위상이 더 크다. 삼성생명 주식 19.47%, 삼성전자 주식 5.01%[3], 삼성바이오로직스 주식 43.44%를 소유했기 때문. 오너 일가가 직접 보유한 삼성전자 지분과 삼성물산, 삼성생명이 보유한 삼성전자 지분을 모두 합하면 19.31%에 달하고, 기타 계열사들과 재단 지분까지 합하면 21%에 가깝다.",
          ent_ceo: "고정석 외 2인",
          ent_img: "../assets/삼성전자.jpg",
          follow: false,
        },
        {
          ent_ind: 0,
          ent_name: "삼성전자",
          ent_info:
            "대한민국에 본사를 두고 전자제품을 제조하는 대한민국 최대의 다국적 기업. 창사 이래로 세계 시장에서 한국 기업으로서는 매우 큰 성공을 이루어냈으며, 현재 가장 인지도가 높은 대표적인 한국 기업으로 자리매김하였다.",
          ent_ceo: "이재용",
          ent_img: "../assets/삼성전자.jpg",
          follow: true,
        },
        {
          ent_id: 1,
          ent_name: "삼성SDS",
          ent_info:
            "삼성(三星) 계열 전산업체로, 삼성의 IT서비스와 물류 사업을 담당하고 있다. 뒷글자만 다른 삼성SDI와 혼동하기 쉽다. 매출이나 이익면에서 국내 IT서비스/시스템 통합 업종에서 단연 최고라 할 수 있다.",
          ent_ceo: "황성우",
          ent_img: "../assets/삼성전자.jpg",
          follow: false,
        },
        {
          ent_id: 2,
          ent_name: "삼성물산주식회사",
          ent_info:
            "삼성그룹(三星) 계열 종합물류/무역/레저/건설 회사이자 삼성의 모태가 되는 회사. 그렇지만, 이런 경제적 위상보다는 삼성그룹의 실질 지주회사라는 정치적 위상이 더 크다. 삼성생명 주식 19.47%, 삼성전자 주식 5.01%[3], 삼성바이오로직스 주식 43.44%를 소유했기 때문. 오너 일가가 직접 보유한 삼성전자 지분과 삼성물산, 삼성생명이 보유한 삼성전자 지분을 모두 합하면 19.31%에 달하고, 기타 계열사들과 재단 지분까지 합하면 21%에 가깝다.",
          ent_ceo: "고정석 외 2인",
          ent_img: "../assets/삼성전자.jpg",
          follow: false,
        },
      ],
    };
  },
};
</script>

<style></style>
